---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.DimToIntersectingWalls
source: html/c920d2b2-6e93-0b3f-21f4-9438a9eda9c6.htm
---
# Autodesk.Revit.DB.ParameterTypeId.DimToIntersectingWalls Property

"Dimension To Intersecting Walls"

## Syntax (C#)
```csharp
public static ForgeTypeId DimToIntersectingWalls { get; }
```